cylinder/inviscid/150ms/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
16796
(
0.0013149243
0.0039524844
0.0066132057
0.0093126716
0.012066681
0.014891335
0.017803125
0.020819025
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        coupledFringe   true;
        conservativeCorrection true;
        setHoleCellValue yes;
        holeCellValue   0;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            fixedValue;
        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
    }
    in
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    cylinder
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
