cylinder/inviscid/150ms/0/divFlux
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      divFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
16796
(
0
6.8042324e-09
1.4933555e-08
1.1436356e-08
2.8387011e-08
-1.4463397e-08
3.7462038e-08
-3.7465306e-09
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        coupledFringe   false;
        conservativeCorrection false;
        setHoleCellValue false;
        holeCellValue   0;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    in
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    cylinder
    {
        type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
