cylinder/inviscid/150ms/0/oversetGammaExt
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      oversetGammaExt;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
16796
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        coupledFringe   false;
        conservativeCorrection false;
        setHoleCellValue false;
        holeCellValue   0;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            calculated;
        value           uniform 1;
    }
    bottom
    {
        type            calculated;
        value           uniform 1;
    }
    in
    {
        type            calculated;
        value           uniform 1;
    }
    top
    {
        type            calculated;
        value           uniform 1;
    }
    front
    {
        type            empty;
    }
    cylinder
    {
        type            calculated;
        value           uniform 1;
    }
    wall
    {
        type            calculated;
        value           uniform 1;
    }
}


// ************************************************************************* //
