cylinder/inviscid/150ms/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
32976
(
-0.24211129
5.1373904e-07
-0.24211283
1.5440787e-06
-0.24211541
2.5829776e-06
-0.24211905
3.6362297e-06
...
)
;

boundaryField
{
    oversetFaces
    {
        type            overset;
        value           nonuniform 0();
    }
    back
    {
        type            empty;
    }
    out
    {
        type            calculated;
        value           nonuniform List<scalar> 
124
(
0.24211077
0.24211032
0.24210955
0.24210804
0.24210622
0.24210396
0.24210141
0.24209813
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 0;
    }
    in
    {
        type            calculated;
        value           nonuniform List<scalar> 
124
(
-0.24193545
-0.24193545
-0.2419356
-0.24193545
-0.24193545
-0.24193545
-0.2419356
-0.24193545
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0;
    }
    front
    {
        type            empty;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
96
(
0.18978615
0.2026326
-0.2026326
-0.18978615
0.2026326
-0.2026326
0.18978615
-0.18978615
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
